&НаКлиенте
Процедура ПечатьЭтикетки(ссНом,УказатьАдресПрнтера=Ложь,Кол=Неопределено) экспорт
	
	Если ЗначениеЗаполнено(ссНом)=Ложь Тогда 
		Сообщить("Пустой объект!");
		Возврат; 
	КонецЕСЛИ;
	
	АдресПринтера = глОбщий.АдресПринтера();
	
	Если ЗначениеЗаполнено(АдресПринтера) = Ложь or УказатьАдресПрнтера Тогда
		Стр = "";
		ООП = новый ОписаниеОповещения("ОкончаниеВводаСтроки",глОбщийКлиент.ЭтотОбъект,ссНом);
		ПоказатьВводСтроки(ООП,Стр,"Введите IP адрес принтера",,Ложь);
		ВозвраТ;
	КонецЕСЛИ;
	
	Если Кол=Неопределено Тогда
		Кол=1;
		ООП = новый ОписаниеОповещения("ОкончаниеВводаКол",глОбщийКлиент.ЭтотОбъект,ссНом);
		ПоказатьВводЧисла(ООП,Кол,"Введите количество этикеток",3,0);
	Иначе
		ОкончаниеВводаКол(Кол,ссНом);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаСтроки(Стр,ДопПар) Экспорт
	
	Если Стр = Неопределено Тогда ВозвраТ; КонецЕСЛИ;
	глОбщий.АдресПринтера(Стр);	
	ПечатьЭтикетки(ДопПар);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаКол(Кол,ДопПар) Экспорт
	Если ЗначениеЗаполнено(Кол) = Ложь Тогда Возврат; КонецЕСЛИ;
	
	ссНом = ДопПар;
	
	АдресПринтера = глОбщий.АдресПринтера();
	Для а=1 по Кол Цикл
		глВыгрузкаДанных.ПечатьZPL(ссНом,АдресПринтера);
	КонецЦиклА;
	
КонецПроцедуры

//---------------------------------------
Процедура ПодключитьГлобальноеСобытиеОповещения() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		Оп = Новый ОписаниеОповещения("ОбработчикЛокальныхУведомлений", ЭтотОбъект);
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(Оп);  
	#КонецЕсли
КонецПроцедуры

Процедура ГлобальноеСобытиеОповещения(Сообщение, ЧтоТоЕще = "") Экспорт

	Попытка
		Отправитель = Число(Сообщение.Отправитель);
	Исключение
		Возврат
	КонецПопытки;
	Если Отправитель = 1 Тогда
		Оповестить(Формат(Отправитель,"ЧГ="),Сообщение.Текст, "Сканирование ШК");
	Иначе 
		Возврат
	КонецЕсли;
КонецПроцедуры

Процедура ОбработчикЛокальныхУведомлений(Уведомление,Локальное,Показано, ЧтоТоЕще) Экспорт
	ГлобальноеСобытиеОповещения(Новый Структура("Отправитель,Текст",Уведомление.Текст,Уведомление.Данные));
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьКомпонентуСканирования() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		НовЗП = Новый ЗапускПриложенияМобильногоУстройства();
		НовЗП.Действие = "com.barcodeto1c.action";
		НовЗП.ДополнительныеДанные.Добавить("ServiceState","Start"); //что сделать: Старт/Стоп
		НовЗП.ДополнительныеДанные.Добавить("ServiceSCAN_MESSAGE","scan.rcv.message"); //чей бродкаст ловить
        НовЗП.ДополнительныеДанные.Добавить("ServiceBarCodeField","barocode"); //в каком поле сканер возвращает штрих-код (если не задавать - по умолчанию barocode, что в большинстве случаев оно так)
		НовЗП.ДополнительныеДанные.Добавить("ServiceEventID","1"); //категория сообщение для 1С
		НовЗП.ДополнительныеДанные.Добавить("ServiceToast","Service STARTED!");//(не обязательно) просто покажет Тост при успехе
		НовЗП.ДополнительныеДанные.Добавить("ServiceBase_Name","");//если одна база - можно поставить ""
		Результат = НовЗП.Запустить(Истина);
		
		Если НЕ Результат = 77 Тогда
             //тут можно отловить что что-то не так. Возможно апк не установлена или что-то не сработало
			 Сообщить("Ошибка "+Результат);
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьКомпонентуСканирования() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
		НовЗП = Новый ЗапускПриложенияМобильногоУстройства();
		НовЗП.Действие = "com.barcodeto1c.action";
		НовЗП.ДополнительныеДанные.Добавить("ServiceState","Stop");
		НовЗП.ДополнительныеДанные.Добавить("ServiceToast","Service STOPED!");
		Результат = НовЗП.Запустить(Истина);
	#КонецЕсли

КонецПроцедуры
//---------------------------------------

&НаКлиенте
Функция КонтрольРаскладки(Данные)
	Соо = новый Соответствие;	
	соо.вставить("`","ё");
	соо.вставить("~","Ё");
	соо.вставить("!","!");
	соо.вставить("@","""");
	соо.вставить("#","№");
	соо.вставить("$",";");
	соо.вставить("^",":");
	соо.вставить("&","?");
	соо.вставить("q","й");
	соо.вставить("w","ц");
	соо.вставить("e","у");
	соо.вставить("r","к");
	соо.вставить("t","е");
	соо.вставить("y","н");
	соо.вставить("u","г");
	соо.вставить("i","ш");
	соо.вставить("o","щ");
	соо.вставить("p","з");
	соо.вставить("[","х");
	соо.вставить("]","ъ");
	соо.вставить("a","ф");
	соо.вставить("s","ы");
	соо.вставить("d","в");
	соо.вставить("f","а");
	соо.вставить("g","п");
	соо.вставить("h","р");
	соо.вставить("j","о");
	соо.вставить("k","л");
	соо.вставить("l","д");
	соо.вставить(";","ж");
	соо.вставить("'","э");
	соо.вставить("z","я");
	соо.вставить("x","ч");
	соо.вставить("c","с");
	соо.вставить("v","м");
	соо.вставить("b","и");
	соо.вставить("n","т");
	соо.вставить("m","ь");
	соо.вставить(",","б");
	соо.вставить(".","ю");
	соо.вставить("/",".");
	
	соо.вставить("{","Х");
	соо.вставить("}","Ъ");
	соо.вставить(":","Ж");
	соо.вставить("""","Э");
	соо.вставить("<","Б");
	соо.вставить(">","Ю");
	соо.вставить("?",",");
	соо.вставить(Символы.ПС," ");
	
	Для каждого Эл из Соо Цикл
		Если ВРЕГ(Эл.Ключ)=эл.ключ Тогда Продолжить; КонецесЛИ;
		Соо.Вставить(ВРЕГ(Эл.Ключ),ВРЕГ(Эл.Значение));
	Конеццикла;
	
	СооАнгл = Новый Соответствие;
	Для каждого Эл из Соо Цикл
		СооАнгл.Вставить(Эл.Значение,Эл.Ключ);
	КонецЦиклА;
	
	Рез = "";
	Есть=ЛожЬ;
	индАнглРаскладки=Ложь;
	Есть_ = Найти(Данные,"_")<>0;
	Для а=1 по СтрДлина(Данные) Цикл
		
		п0 = Сред(Данные,а,1);	
		Если п0="_" Тогда
			индАнглРаскладки=Истина;
			ПродолжитЬ;
		КонецЕСЛИ;
		
		Если индАнглРаскладки Тогда
			п = СооАнгл.Получить(п0);
		ИНаче
			п = Соо.Получить(п0);
		КонецеСЛИ;
		индАнглРаскладки=Ложь;
	
		Если п=Неопределено ТОгда
			Рез = Рез + п0;
		ИНаче
			Рез = Рез + п;
			Есть = Истина;
		КонецЕСЛИ;
		
		Если а=10 и Есть = Ложь и Есть_=Ложь Тогда
			Рез = Данные;
			прервать;
		КонецЕСЛИ;
		
	КонецЦикла;
	
	Возврат Рез;
	
	
КонецФункции

&НаКлиенте
Функция  ПолучитьДату(Стр)
//Сообщить(Стр);
	п = СтрЗаменить(Стр,".",Символы.ПС);
	п = СтрЗаменить(п,"ю",Символы.ПС);
	п = СтрЗаменить(п," ",Символы.ПС);
	п = СтрЗаменить(п,":",Символы.ПС);
	п = СтрЗаменить(п,"Ж",Символы.ПС);
	п = СтрЗаменить(п,"-",Символы.ПС);
	п = СтрЗаменить(п,"T",Символы.ПС);
	п = СтрЗаменить(п,"Е",Символы.ПС);
	  
	Попытка
		Год = Число(СтрПолучитьСтроку(п,1));
		Мес = Число(СтрПолучитьСтроку(п,2));
		Ден = Число(СтрПолучитьСтроку(п,3));
		
		Возврат Дата(Год,Мес,Ден);
	Исключение
		Возврат Дата(1,1,1);
	КонецПопытки;
	
	
КонецФункции

&НаКлиенте
Процедура разобратьФорматГазПром(ДанныЕ,СткРез)
	
	
		ЕстьВоскл0 = Найти(ДанныЕ,"_!!_")<>0;
		ЕстьВоскл1 = Найти(ДанныЕ,"!!")<>0;
		п = СтрЗаменить(ДанныЕ,Символы.ПС,"");	
		
		ШтрихКод = СтрЗаменить(п,Символ(124),Символы.ПС);	
		
		
		Если СтрЧислоСтрок(ШтрихКод) < 5 Тогда 
		//	Возврат;
		КонецЕСЛИ;
		
		СткРез.ВидДок = "Путевой лист";
		СткРез.НомерПЛ = СокрЛП(СтрПолучитьСтроку(ШтрихКод,2));
		СткРез.ДатаПЛ = ПолучитьДату(СтрПолучитьСтроку(ШтрихКод,3));
		СткРез.ГосНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,6));
		СткРез.ТабНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,8));
		
		Если ЕстьВоскл0 Тогда
			
			пСтр= Сред(ШтрихКод,Найти(ДанныЕ,"_!!_")+4);
			
			пСтр = СтрЗаменить(пСтр,"%%!!%%",Символы.ПС);
			
			бин = ПолучитьДвоичныеДанныеИзBase64Строки(пСтр);
			п   = ПолучитьСтрокуИзДвоичныхДанных(бин);
			п 	= СтрЗаменить(п,Символ(124),Символы.ПС);	
			
			
			СткРез.Сотрудник 	= СокрЛП(СтрПолучитьСтроку(п,1));
			СткРез.ТС 			= СокрЛП(СтрПолучитьСтроку(п,2));
			Сткрез.ГарНомер 	= СокрЛП(СтрПолучитьСтроку(п,3));
			
			
		
		ИначеЕсли ЕстьВоскл1 Тогда
			
			Для а=7 по  СтрЧислоСтрок(ШтрихКод) Цикл
				пС = СтрПолучитьСтроку(ШтрихКод,а);
				если Лев(пС,2)<>"!!" Тогда Продолжить; КонецЕсли;
				
				СткРез.Сотрудник = СтрЗаменить(СтрПолучитьСтроку(ШтрихКод,а),"!!","");
				СткРез.ТС = СокрЛП(СтрПолучитьСтроку(ШтрихКод,а+1));
				СткРез.ГарНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,а+2));
				
				прервать;
			КонецЦикла;
		
		КонецЕСЛИ;
		
		
КонецПроцедуры


&НаКлиенте
Процедура разобратьФормат1(Данные,СткРез)
	
	п = КонтрольРаскладки(Данные);
	п = СтрЗаменить(п,Символы.ПС,"");	
	
	ШтрихКод = СтрЗаменить(п,Символ(124),Символы.ПС);	
	
	
	Сткрез.ВидДок 	= "Рем.лист";
	СткРез.НомерПЛ 	= СокрЛП(СтрПолучитьСтроку(ШтрихКод,4));
	СткРез.ДатаПЛ 	= ПолучитьДату(СтрПолучитьСтроку(ШтрихКод,5));
	СткРез.ГосНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,6));
	СткРез.Сотрудник= СокрЛП(СтрПолучитьСтроку(ШтрихКод,7));
	СткРез.ТС 		= СокрЛП(СтрПолучитьСтроку(ШтрихКод,8));
	СткРез.ГарНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,9));
	
	
КонецПроцедуры


&НаКлиенте
Процедура разобратьФормат2(Данные,СткРез)
	
	
	пСтр =  Сред(Данные,5);
	пСтр = СтрЗаменить(пСтр,"%%!!%%",Символы.ПС);
	
	бин = ПолучитьДвоичныеДанныеИзBase64Строки(пСтр);
	п = ПолучитьСтрокуИзДвоичныхДанных(бин);
	
	ШтрихКод 		= СтрЗаменить(п,Символ(124),Символы.ПС);	
	
	//Сообщить(СтрПолучитьСтроку(ШтрихКод,3));
	
	Сткрез.ВидДок 	= СокрЛП(СтрПолучитьСтроку(ШтрихКод,1));
	СткРез.НомерПЛ 	= СокрЛП(СтрПолучитьСтроку(ШтрихКод,2));
	СткРез.ДатаПЛ 	= Дата(СтрПолучитьСтроку(ШтрихКод,3));
	СткРез.ГосНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,4));
	СткРез.ГарНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,5));
	СткРез.ТС 		= СокрЛП(СтрПолучитьСтроку(ШтрихКод,6));
	СткРез.Сотрудник= СокрЛП(СтрПолучитьСтроку(ШтрихКод,7));
	СткРез.ТабНомер = СокрЛП(СтрПолучитьСтроку(ШтрихКод,8));
	СткРез.ДтФорм   = СокрЛП(СтрПолучитьСтроку(ШтрихКод,9));
	СткРез.ИНН 		= СокрЛП(СтрПолучитьСтроку(ШтрихКод,10));
	
	
КонецПроцедуры


&НаКлиенте
Функция ЗаполнитьОснование(ДанныЕ) Экспорт
	
	
	СткРез = новый Структура("ДокументОснование,ТС,Сотрудник,Гарномер,ГосНомер,НомерПЛ,ДатаПЛ,ВидДок,ТабНомер,ИНН,дтФорм");
	
	Если Лев(Данные,4)="_!!_" Тогда
		разобратьФормат2(ДанныЕ,СткРез);
	ИначеЕсли Лев(Данные,5)="_!_!_" Тогда
		разобратьФормат1(ДанныЕ,СткРез);
	Иначе
		разобратьФорматГазПром(ДанныЕ,СткРез);
	КонецЕСЛИ;
	
	Возврат СткРез;
	
	
КонецФункции


