
&НаСервере
Процедура ПереключательВидДокументаПриИзмененииНаСервере()
	
	поле = Новый ПолеКомпоновкиДанных("ВидДокумента");
	Для каждого Эл из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = поле Тогда
			Эл.ПравоеЗначение = ПереключательВидДокумента;
			Эл.Использование = Истина;
			прервать;
		КонецЕСЛИ;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательВидДокументаПриИзменении(Элемент)
	ПереключательВидДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПереключательВидДокумента = Перечисления.ВидДокумента.ро_СтатусВРаботе;
	ПереключательВидДокументаПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Стк = Новый Структура("ВидДокумента",ПереключательВидДокумента);
	СткПар = Новый Структура("ЗначенияЗаполнения",Стк);
	
	ОткрытьФорму("Документ.ро_Отгрузка.Форма.ФормаДокумента",СткПар,Список,ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура Выгрузить(Команда)
	глВыгрузкаДанных.ВыгрузитьРо_Отгрузку(Элементы.Список.ТекущаяСтрока);
	ПереключательВидДокументаПриИзмененииНаСервере();
КонецПроцедуры

