
&НаКлиенте
Процедура ОчиститьВсеЗаписиИнвентаризации(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	
	
	ПоказатьВопрос(Оповещение, "Очистить все записи инвентаризации?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	
	РежимДиалогаВопрос.ДаНет,
	
	0,  // задержка (секунды). необязательно
	
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	
	"" // устанавливаем заголовок. необязательно
	
);
КонецПроцедуры


&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего
	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОчиститьЗаписиИнвентаризации();
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОчиститьЗаписиИнвентаризации()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	инвИнвентаризация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.инвИнвентаризация КАК инвИнвентаризация";
	
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Выб.ссылка.ПолучитьОбъект().Удалить();
	КонецЦиклА;
	
КонецПроцедуры