
&НаСервереБезКонтекста
Процедура ОбновитьСписокНаСервере()
	глВыгрузкаДанных.ЗагрузитьОстаткиЗаказНаряды();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
	Элементы.Список.Обновить(); 
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	текСтр = Элементы.Список.ТекущиеДанные;
	Если спкЗаказов.НайтиПоЗначению(текСтр.ЗаказНаряд)=Неопределено ТОгда
		Стк = новый Структура("ЗаказНарядИд,ОборудованиеСтр,ЗаказНаряд,НомерОборудования");
		ЗаполнитьЗначенияСвойств(Стк,текстр);
		спкЗаказов.Добавить(стк,""+СокрЛП(текСтр.ЗаказНаряд)+" "+текСтр.ОборудованиеСтр);
	КонецеСЛИ;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Контрагент",Контрагент);
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМасКА()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ DISTINCT
	               |	ОстаткиОборудования.Контрагент КАК Контрагент
	               |ИЗ
	               |	РегистрСведений.ОстаткиОборудования КАК ОстаткиОборудования";
	Мас = новый Массив;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Мас.Добавить(Выб.Контрагент);
	КонецЦикла;
	
	Возврат Мас;
	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	
	//текЭЛ = Элементы.КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение;
	//текЭЛ.КнопкаВыпадающегоСписка = Истина;
	текЭл = элементы.Контрагент;
	текЭл.СписокВыбора.ЗагрузитьЗначения(ПолучитьМасКА()); 
	текЭл.РедактированиеТекста = Ложь;
	
	Контрагент = Контрагент;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ЭтаФорма.Закрыть(спкЗаказов.ВыгрузитьЗначения());
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	поле = Новый ПолеКомпоновкиДанных("Контрагент");
	
	новЭл = Неопределено;
	
	Для каждого эл из Список.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = поле Тогда
			новЭл = Эл;
		КонецеСЛИ;
	Конеццикла;

	Если новЭл = Неопределено Тогда
		новЭл = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		новЭл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		новЭл.ЛевоеЗначение = поле;
	КонецЕСЛИ;
	новЭл.ПравоеЗначение = Контрагент;
	новЭл.Использование = СокрЛП(Контрагент)<>"";
	
	//Для каждого эл из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если Эл.ЛевоеЗначение = поле Тогда
	//		эл.ПравоеЗначение = Контрагент;
	//		эл.Использование = СокрЛП(Контрагент)<>"";
	//	КонецеСЛИ;
	//Конеццикла;
		
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

