
&НаКлиенте
Процедура Декорация4ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ПерейтиПоНавигационнойСсылке("https://azureuttdiag.blob.core.windows.net/mp1c/Сбросить настройк zebra 2824.PNG");
КонецПроцедуры

&НаКлиенте
Процедура Декорация5ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ПерейтиПоНавигационнойСсылке("https://azureuttdiag.blob.core.windows.net/mp1c/Zebra2824plus.pdf");
КонецПроцедуры
