
&НаСервереБезКонтекста
Процедура СторноНаСервере(сс)
	Справочники.двжТМЦ.СторноНаСервере(сс);
КонецПроцедуры

&НаКлиенте
Процедура Сторно(Команда)
	СторноНаСервере(Объект.Ссылка);
	Элементы.Сторно.Видимость = ложЬ;
	ОповеститьОЗаписиНового(Объект.Ссылка);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Сделатьсторно(Команда)
	Элементы.Сторно.Видимость = 1 - Элементы.Сторно.Видимость;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСторно(сс,ТекКол)
	Если ТекКол<=0 Тогда Возврат Ложь; КонецЕСЛИ;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	двжТМЦ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.двжТМЦ КАК двжТМЦ
	               |ГДЕ
	               |	двжТМЦ.спрСторно = &спрСторно";
	Запрос.УстановитьПараметр("спрСторно",сс);
	Возврат  Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Сделатьсторно.Видимость = ЕстьСторно(Объект.Ссылка,объект.Количество);
КонецПроцедуры
