&НаСервереБезКонтекста
Функция СогласоватьНаСервере(Рез,сс)
	
	Обк = сс.ПолучитьОбъект();
	Обк.Статус = Рез;
	Обк.ДатаСинхронизации = дата(1,1,1);
	Обк.ОбменДанными.Загрузка = Истина;
	Обк.Записать();
	
	Возврат обк.ссылка;
	
КонецФункции


&НаКлиенте
Процедура Согласовать(Команда)
	Если Элементы.инвИнвентаризацияВчера.ТекущаяСтрока<>Неопределено Тогда
		сс = СогласоватьНаСервере(1,Элементы.инвИнвентаризацияВчера.ТекущаяСтрока);
		ОповеститьОбИзменении(сс);
	КонецЕСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура Отказать(Команда)
	Если Элементы.инвИнвентаризацияВчера.ТекущаяСтрока<>Неопределено Тогда
		сс = СогласоватьНаСервере(-1,Элементы.инвИнвентаризацияВчера.ТекущаяСтрока);
		ОповеститьОбИзменении(сс);
	КонецЕСЛИ;
КонецПроцедуры


&НаСервере
Процедура ФильтрСтатусПриИзмененииНаСервере()
	поле = Новый ПолеКомпоновкиДанных("Статус");
	Для каждого Эл из инвИнвентаризацияВчера.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = поле Тогда
			Эл.ПравоеЗначение = ФильтрСтатус;
			Эл.Использование = Истина;
			прервать;
		КонецЕСЛИ;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусПриИзменении(Элемент)
	ФильтрСтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗапросы(Команда)
	глВЫгрузкаДанных.ВыгрузитьЗапросыНаВыдачуТМЦ();
	глВыгрузкаДанных.ЗагрузитьЗапросыНаВыдачуТМЦ(Истина);
	ФильтрСтатусПриИзмененииНаСервере();
КонецПроцедуры



