
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Расскраска();
КонецПроцедуры

&НаКлиенте
Процедура Расскраска()
	
	Если глДоступ.ПолучитьОтправкаНаВнешнийАдрес() Тогда
		Элементы.ЧерезИнтернет.ЦветФона=webЦвета.Аквамарин;
		Элементы.ЧерезWiFi.ЦветФона=Новый Цвет;
	ИНаче
		Элементы.ЧерезИнтернет.ЦветФона=Новый Цвет;
		Элементы.ЧерезWiFi.ЦветФона=webЦвета.Аквамарин;
	КонецеСЛИ;
	
КонецПроцедуры

&НаКлиенте
Процедура ЧерезИнтернет(Команда)
	глДоступ.УстановитьОтправкаНаВнешнийАдрес(Истина);
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЧерезWiFi(Команда)
	глДоступ.УстановитьОтправкаНаВнешнийАдрес(Ложь);
	ЭтаФорма.Закрыть();
КонецПроцедуры
