
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстФильтрСклад();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Склад") ТОгда
	Склад = Параметры.Склад;
	КонецеСЛИ;
	УстФильтрСклад();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаПредОстатков(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "SELECT MAX(ДатаПредОстатков) Дт FROM РегистрСведений.Остатки КАК рег ГДЕ Склад = &Склад  ";
	Запрос.УстановитьПараметр("Склад",Склад);
	
	ВЫб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Возврат Выб.Дт;
	ИНАче
		Возврат ТекущаяДата();
	КонецЕСЛИ;
	
КонецФункции

&НаСервере
Процедура УстФильтрСклад()
	эл = Список.Параметры.Элементы.Найти("Склад");
	Эл.Значение = Склад;
	Эл.Использование = Истина;
	
	эл = Список.Параметры.Элементы.Найти("ДтПредОст");
	Эл.Значение = ДатаПредОстатков(Склад);
	Эл.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	оо = Новый ОписаниеОповещения("ПослеВводаКолва",ЭтотОбъект,ВыбраннаяСтрока);
	ПоказатьВводЧисла(оо, 1, "Введите количество", 10, 3);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКолва(Число,ВыбраннаяСтрока) Экспорт
	
	Если Число=Неопределено Тогда Возврат; КонецЕСЛИ;
	Если Число<= 0 Тогда Возврат; КонецЕСЛИ;
	
	ВладелецФормы.ОбработкаПодбора(Элементы.Список.ТекущиеДанные.Номенклатура,Элементы.Список.ТекущиеДанные.Место,Число);
	этаформа.Закрыть();
КонецПроцедуры


