
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = этаФорма.Параметры.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБар()
	Если ОБновитьБарНаСервере() Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОбновитьБарНаСервере()
	
	Если глВыгрузкаДанных.ПроверитьКлючФоновогоЗадания("ЗагрузкаСправочника")= Истина ТОгда
		Прогресс = 100;
		Возврат Истина;
	КонецЕСЛИ;
	
	Стк = ПолучитьИзВременногоХранилища(Адрес);
	Если ТипЗнч(Стк)=Тип("Структура") Тогда
		Элементы.Прогресс.Заголовок = Стк.Вид;
		Прогресс = Стк.Зн;
	КонецесЛИ;
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбновитьБар",2);
КонецПроцедуры
