
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка = Истина Тогда Возврат; КонецЕСЛИ;
	
	Если глДоступ.ДоступНоменклатура()=Ложь Тогда
		Сообщить("Нет доступа к записи номенклатуры!");
		отказ = Истина;
		Возврат;
	КонецЕСЛИ;
	
	Если ЗначениеЗаполнено(ссылка) Тогда
		Если ссылка.пометкаУдаления <> ПометкаУдаления Тогда
			Если глВыгрузкаДанных.ВыгрузитьПометкуНаУдаление(ЭтотОбъект)=Ложь Тогда
				Отказ = Истина;
			КонецЕСЛИ;
			
			Возврат;//----
			
		КонецеслИ;
	КонецесЛИ;
	
	ДатаСинхронизации = дата(1,1,1);
	ДатаИзменения = ТекущаяДата();
	
	
КонецПроцедуры
