&НаКлиенте
Перем КонстантаСклад;
&НаКлиенте
Перем СекундВПолеМесто;

&НаСервере
Функция ПолучитьИнвНом(КонстантаСклад,Номенклатура,ШтрихКод,Производитель,ТекКоличество=1)
	
	Обк = Справочники.ЗаявкиНаВыдачуТМЦ.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Обк,ЭтаФорма);
	Обк.Дата = текущаяДата();
	Обк.Лог = ""+ТекущаяДата()+"_"+ИмяКомпьютера();
	Обк.Склад = КонстантаСклад;
	Обк.Код = номенклатура.Код;
	Обк.Номенклатура = Номенклатура;
	обк.Количество = ТекКоличество;
	Обк.ГарНомер = гарНомер; 
	Обк.ГосНомер = госНомер; 
	Обк.ТСстр = ТС; 
	Обк.ТабНомер = ТабНомер; 
	Обк.Сотрудник = Сотрудник; 
	Обк.ДокументОснование = ДокументОснование; 
	Обк.Записать();
	
	Возврат Обк.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция НоменклатураСовпадает(Ном,ШтрихКод,ИнвИнв,ГарНомер)
	Если ЗначениеЗаполнено(инвИнв)=Ложь Тогда Возврат Ложь; КонецЕСЛИ;
	Возврат Ном = инвИнв.Номенклатура и ШтрихКод = инвИнв.ШтрихКод и ГарНомер = инвИнв.ГарНомер;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДО(ИНН,КонстантаСклад)
	сс = Справочники.Организации.НайтиПоКоду(ИНН);
	Если сс.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если сс = КонстантаСклад.Организация Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	ИНаче
		Возврат сс;
	КонецеСЛИ;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОснование(ДанныЕ)
	
	СткРез = глОбщийКлиент.ЗаполнитьОснование(ДанныЕ);
	
	ДокументОснование = СткРез.ВидДок+" №"+СткРез.номерПЛ+" от "+Формат(СткРез.ДатаПЛ,"ДФ=dd.MM.yyyy");
	
	гарНомер 	= СткРез.ГарНомер;
	ГосНомер 	= СткРез.ГосНомер;
	ТС			= СткРез.ТС;
	Сотрудник 	= СткРез.Сотрудник;
	ТабНомер	= СткРез.ТабНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст="", ДанныеВыбора=Неопределено, ПараметрыПолученияДанных=Неопределено, СтандартнаяОбработка=Истина)
	СтандартнаяОбработка = ложь;
	ТекНом = Неопределено;
	ШтрихКод = "";
	Производитель = "";
	ТекКоличество = 1;
	
	Если ТипЗнч(Элемент)=Тип("Структура") Тогда
		ТекНом = Элемент.Номенклатура;
		ЭтаФорма.инвНоменклатура = Неопределено;
		ТекКоличество = Элемент.Количество;
		
	//Установка места
	ИНачеЕсли Лев(Текст,3) = "(!)" Тогда
		//ЭтаФорма.Место = Число(Сред(Текст,4));
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ВоспроизвестиТекст("Место "+ЭтаФорма.Место); 
		#КонецЕсли
		Текст="";
	ИНачеЕсли стрДлина(Текст)>21  Тогда
		ЗаполнитьОснование(Текст);
		Текст="";
	ИначеЕсли СокрлП(ДокументОснование)="" ТОгда
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ВоспроизвестиТекст("Не указан документ основание!"); 
		#КонецЕсли
		Текст="";
	ИНаче
		ТекНом = глОбщий.НоменклатураАвтоПодборНаСервере(Текст,ШтрихКод,Производитель);
	КонецЕСЛИ;
	
	
	Если ТекНом <> Неопределено Тогда
		Сигнал();
		Текст = "";
		ЭтаФорма.СтрокаПодбора = "";
		Если НоменклатураСовпадает(ТекНом,ШтрихКод,ЭтаФорма.инвНоменклатура,ГарНомер) Тогда
			КолПлюс(Элемент,Ложь);
		ИНаче
			ЭтаФорма.Количество      = ТекКоличество;
			ЭтаФорма.инвНоменклатура = ПолучитьИнвНом(КонстантаСклад,ТекНом,ШтрихКод,Производитель,ТекКоличество);
			Элементы.инвИнвентаризация.ТекущаяСтрока = ЭтаФорма.инвНоменклатура;
		КонецЕсли;
		
	ИНаче
		ЭтаФорма.СтрокаПодбора = Текст;
		
		ЭтаФорма.Количество    = 0;
		ЭтаФорма.инвНоменклатура = Неопределено;
	КонецеСЛИ;
	
	ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры
	

&НаКлиенте
Процедура ПодборПоКодуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	НоменклатураОкончаниеВводаТекста(Элемент, "!!"+СокрЛП(Текст), ДанныеВыбора, ПараметрыПолученияДанных, ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВопросШтрихКод()
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	
	
	ПоказатьВопрос(Оповещение, "Записать штрих-код?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	
	РежимДиалогаВопрос.ДаНет,
	
	0,  // задержка (секунды). необязательно
	
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	
	"" // устанавливаем заголовок. необязательно
	
);
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего


Если Результат = КодВозвратаДиалога.Да Тогда
	
	Фрм = ПолучитьФорму("РегистрСведений.ШтрихКоды.Форма.ФормаЗаписи",,ЭтаФорма,ЭтаФорма);
	Фрм.ЭтаФорма.Запись.ШтрихКод = ЭтаФорма.СтрокаПодбора;
	Фрм.Открыть();
	
КонецЕсли;

ЭтаФорма.СтрокаПодбора = "";

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОтображениеДанныхФормы()
	
	Элементы.Количество.ОбновитьТекстРедактирования();	
	Элементы.инвИнвентаризация.Обновить();
	ЭтаФорма.Заголовок = "Остаток: "+ПолучитьТхтОстатки(ЭтаФорма.инвНоменклатура,КонстантаСклад);
	
	//#Если МобильныйКлиент Тогда
		ЭтаФорма.ТекущийЭлемент = элементы.СтрокаПодбора;
		ЭтаФорма.НачатьРедактированиеЭлемента();
	//#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТхтОстатки(текИнв,ТекСклад)
	
	Если ЗначениеЗаполнено(текИнв) = Ложь Тогда
		Возврат "";
	КонецЕСЛИ;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	SUM(инвИнвентаризация.Количество) КАК Кол,
				   |    0 Ост
	               |ИЗ
	               |	Справочник.двжТМЦ КАК инвИнвентаризация
	               |ГДЕ
	               |	инвИнвентаризация.Номенклатура = &Номенклатура
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
				   |    0 Кол,
				   |	SUM(Остатки.Количество) КАК Ост
				   |ИЗ
				   |	РегистрСведений.Остатки КАК Остатки
				   |ГДЕ
				   |	Остатки.Номенклатура = &Номенклатура
				   |  и Склад = &Склад
				   |";
	Запрос.УстановитьПараметр("Номенклатура",текИнв.Номенклатура);
	Запрос.УстановитьПараметр("Склад",ТекСклад);
	Тбл = запрос.Выполнить().Выгрузить();
	
	Возврат ""+Тбл.Итог("Кол")+" / "+Тбл.Итог("Ост");
	
	
КонецФункции

&НаКлиенте
Процедура КолПлюс(Команда,ОбновитьДанныеФормы=Истина)
	
	Если ЗначениеЗаполнено(ЭтаФорма.инвНоменклатура)=Ложь Тогда ВозвраТ; КонецЕСЛИ;
	Если ЗначениеЗаполнено(ЭтаФорма.Место)=Ложь Тогда ВозвраТ; КонецЕСЛИ;
	
	Если Команда.Имя = "КолМинус" Тогда
		Кол =  -1;
	Иначе
		Кол = 1;
	КонецЕсЛИ;
	
	ЭтаФорма.Количество = ИзменитьКоличество(этаФорма.инвНоменклатура,Кол);
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ВоспроизвестиТекст(СокрЛП(ЭтаФорма.Количество)); 
	#КонецЕсли
	//Сигнал();
	Если ОбновитьДанныеФормы Тогда
		ОбновитьОтображениеДанныхФормы();
	КонецЕСЛИ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьКоличество(текИнв,Кол,установить=Ложь)
	
	Обк = текИнв.ПолучитьОбъект();
	Если установить Тогда
		Обк.Количество = Макс(0,Кол);
	ИНаче
		Обк.Количество = Макс(0,Обк.Количество+Кол);
	КонецеслИ;
	Обк.Записать();
	
	Возврат Обк.Количество;
	
КонецФункции

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(этаФорма.инвНоменклатура) Тогда
		ЭтаФорма.Количество = ИзменитьКоличество(этаФорма.инвНоменклатура,ЭтаФорма.Количество,истина);
		Сигнал();
	ИНаче
		ЭтаФорма.Количество = 0;
	КонецЕСЛИ;
	ОбновитьОтображениеДанныхФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если МобильноеПриложениеКлиент Тогда
		ПодключитьОбработчикОжидания("ФокусНаПодбор",1,Ложь);
	#КонецЕсли
	
	СекундВПолеМесто = 0;
	ДатаОтчета = ТекущаяДата();

	КонстантаСклад = глДоступ.ПолучитьОсновнойСклад();
	Если ЗначениеЗаполнено(КонстантаСклад) = Ложь ТОгда
		отказ = истина;
		Сообщить("Не выбран склад!");
	КонецЕСЛИ;
	
	ФильтрСтатус = 1;
	ФильтрСтатусПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФокусНаПодбор()
	
	Если  Элементы.грСтраницы.ТекущаяСтраница <> Элементы.ГрСтр1 ТОгда Возврат; КонецеСЛИ;
	
	Если ТипЗнч(ЭтаФорма.ТекущийЭлемент)=Тип("ПолеФормы") Тогда
		Простой = ложЬ;
		Если ЭтаФорма.ТекущийЭлемент.Имя = "Место" и СекундВПолеМесто<=3  Тогда
			СекундВПолеМесто = СекундВПолеМесто + 1;
			Простой = Истина;
		ИНаче
			СекундВПолеМесто = 0;
		КонецЕСЛИ;
		
		Если ЭтаФорма.ТекущийЭлемент.Имя = "СтрокаПодбора" Тогда
			ЭтаФорма.НачатьРедактированиеЭлемента();
			Возврат;
		ИНачеЕсли ЭтаФорма.ТекущийЭлемент.Имя = "Количество" 
			или   ЭтаФорма.ТекущийЭлемент.Имя = "ПодборПоКоду"
			или   Простой
			//		  или ЭтаФорма.ТекущийЭлемент.Имя = "Место" 
			Тогда
			Возврат;
		КонецЕСЛИ;
	КонецЕСЛИ;
	
	ЭтаФорма.ТекущийЭлемент = элементы.СтрокаПодбора;
	ЭтаФорма.НачатьРедактированиеЭлемента();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ЭтаФорма.СтрокаПодбора = "";
	ЭтаФорма.Количество    = 0;
	ЭтаФорма.инвНоменклатура = Неопределено;
	//Сообщить(НовыйОбъект);
	Элементы.инвИнвентаризация.ТекущаяСтрока = НовыйОбъект;
	ОбновитьОтображениеДанныхФормы();
КонецПроцедуры

&НаКлиенте
Процедура инвИнвентаризацияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ОткрытьФорму("Справочник.ЗаявкиНаВыдачуТМЦ.ФормаОбъекта",Новый Структура("Ключ",ВыбраннаяСтрока),ЭтаФорма,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихКод(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		Опопвещение = Новый ОписаниеОповещения("ЗавершениеСканирования",ЭтотОбъект);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование штрих-кода",Опопвещение);
		
		//бин = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя);
		//Сообщить(Бин.ТипСодержимого);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСканирования(ШтрихКод,Результат,Сообщение,ДопПар ) Экспорт
	
	НоменклатураОкончаниеВводаТекста(Элементы.СтрокаПодбора, ШтрихКод, Неопределено, Неопределено, ложь);	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли

	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДень(Команда)
	
	глВыгрузкаДанных.ВыгрузитьЗапросыНаВыдачуТМЦ();
	Оповестить("ОбновитьДтСинхро");
	//ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура грСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	//ДокументОснование = "тест";
	Если СокрлП(ДокументОснование)="" ТОгда
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ВоспроизвестиТекст("Не указан документ основание!"); 
		#КонецЕсли
		Возврат;
	КонецЕСЛИ;
	
	Стк = Новый Структура("Склад",КонстантаСклад);
	ОткрытьФорму("Обработка.Подбор.Форма.Форма",стк,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбора(Номенклатура,Место,Количество) Экспорт
	НоменклатураОкончаниеВводаТекста(Новый Структура("Номенклатура,Место,Количество",Номенклатура,Место,Количество));
КонецПроцедуры

&НаСервере
Процедура ФильтрСтатусПриИзмененииНаСервере()
	поле = Новый ПолеКомпоновкиДанных("Статус");
	Для каждого Эл из инвИнвентаризацияВчера.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение = поле Тогда
			Эл.ПравоеЗначение = ФильтрСтатус;
			Эл.Использование = Истина;
			прервать;
		КонецЕСЛИ;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСтатусПриИзменении(Элемент)
	ФильтрСтатусПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьЗапросы(Команда)
	глВыгрузкаДанных.ЗагрузитьЗапросыНаВыдачуТМЦ();
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
		// Вставить содержимое обработчика.
		Выб = Справочники.ЗаявкиНаВыдачуТМЦ.Выбрать();
		Пока Выб.Следующий() Цикл
			Выб.ПолучитьОбъект().Удалить();
		КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры







