
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Принять(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеФотоСнимка()
	
	Данные = Неопределено;
	
	#Если МобильноеПриложениеКлиент Тогда 
		
		
		Данные = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя); 
		
	#КонецЕсли
	
	Возврат Данные;
	
КонецФункции   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//мас = Неопределено;
	//Параметры.Свойство("масном",мас);
	//Если ТипЗнч(мас)=Тип("Массив") Тогда
	//	Для каждого эл из мас Цикл
	//		НовСтр = тблМатериалы.Добавить();
	//		ЗаполнитьЗначенияСвойств(новСтр,эл);
	//	КонецЦикла;
	//КонецЕСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда 
		Данные = ПолучитьДанныеФотоСнимка();
		Если Данные=Неопределено Тогда 
			ЭтаФорма.Закрыть();
			Возврат; 
		КонецЕСли;
		Бин = Данные.ПолучитьДвоичныеДанные();
	#Иначе
		Бин = Новый ДвоичныеДанные("C:\Users\AdminAzure\Pictures\2.jpeg");
	#КонецЕсли

	
	
	фотоБин = ПоместитьВоВременноеХранилище(Бин);
	ЭтаФорма.ВладелецФормы.АдресФотоХР = фотоБИН;
	ЭтаФорма.ВладелецФормы.фотоБИН = фотоБИН;
	ЭтаФорма.ВладелецФормы.Объект.естьФото = Истина;
	ЭтаФорма.Закрыть();
	//Элементы.тблМатериалы.Видимость = Ложь;
	//Элементы.фотоБин.Видимость = Истина;
КонецПроцедуры



&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры
