
&НаСервере
Функция ЗаписатьХранилищеВСтроку(Тбл,ТекДт=Неопределено)
	
	Если ТекДт = Неопределено Тогда
		ТекДТ = ТекущаяДата();
	КонецЕСЛИ;
	
	Стк = Новый структура();
	Для а=1 по ТБл.Колонки.Количество() Цикл
		Кол = ТБл.Колонки[а-1];
		
		Если Найти(Кол.Имя,"GUID") <> 0 Тогда
			п = Кол.Имя;
			Кол.Имя = п+"1";
			ТБл.Колонки.Добавить(п,Новый ОписаниеТипов("Строка"));
			Стк.Вставить(п+"1",п);
		КонецЕСЛИ;
		
	КонеццИклА;
	
	Если Стк.Количество()<>0 Тогда
		Для каждого Стр из ТБл Цикл
			Для каждого эл из Стк Цикл
				Стр[эл.Значение] = Стр[эл.Ключ].УникальныйИдентификатор();
			Конеццикла;
		КонецЦикла;
	КонецЕсли;
	
	
	
	//Мас = Новый МАссив;
	//Мас.Добавить(ТекДТ);
	//МАс.ДОбавить(ТБл);
	
	хр = Новый ХранилищеЗначения(ТБл,Новый СжатиеДанных(5));
	Возврат XMLСтрока(хр);
	
КонецФункции
			


Процедура А()
	
	тблОткл.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дт1",Дт1);
	//Запрос.УстановитьПараметр("Дт2",КонецДня(Дт2)+1);
	Запрос.Текст = "ВЫБРАТЬ
	               |	двжТМЦ.Ссылка КАК СсылкаGUID,
	               |	двжТМЦ.Дата КАК Дата,
	               |	двжТМЦ.Номенклатура КАК НоменклатураGUID,
	               |	двжТМЦ.Количество КАК Количество
	               |ИЗ
	               |	Справочник.двжТМЦ КАК двжТМЦ
				   |WHERE 
				   |     (двжТМЦ.Дата >= &Дт1 или &Дт1 = ДатаВремя(1,1,1))
				   //| and (двжТМЦ.Дата <  &Дт2 или &Дт2 = ДатаВремя(1,1,1))
				   |";
	
	Тбл  = Запрос.Выполнить().Выгрузить();
	
	
			 
			 
			 ТекОрг = глДоступ.ПолучитьОсновнойСклад().Организация;
			 СткСоединение = глОбщий.СткПолучитьСоединение(текОрг);
			 стрАПИ = "/"+текОрг.APIrest+"/hs/invAPI/COMPDVG";
			 
			 Соединение = Новый HTTPСоединение(
			 СткСоединение.Сервер, // сервер (хост)
			 СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
			 СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
			 СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
			 , // здесь указывается прокси, если он есть
			 , // таймаут в секундах, 0 или пусто - не устанавливать
			 // защищенное соединение, если используется https
			 );
			 
			 
			 Запрос = Новый HTTPЗапрос(стрАПИ);
			 Запрос.УстановитьТелоИзСтроки(ЗаписатьХранилищеВСтроку(Тбл));
			 
			 Результат = Соединение.ОтправитьДляОбработки(Запрос);
			 Если Результат.КодСостояния <> 200 Тогда 
				 Сообщить("Ошибка синхронизации: код "+Результат.КодСостояния);
				 Сообщить(результат.ПолучитьТелоКакСтроку());
				 Возврат;
			 КонецЕСЛИ;
			 
			 Тбл = XMLзначение(Тип("ХранилищеЗначения"),результат.ПолучитьТелоКакСтроку()).Получить();
			 //Сообщить(Тбл.Количество());
			 
			 
			 Для каждого Стр из Тбл Цикл
				 НовСтр = тблОткл.добавить();
				 новСтр.двжТМЦ = Справочники.двжТМЦ.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.ссылкаGUID));
				 Если СокрлП(Стр.Ном)<>"" Тогда
					 новСтр.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.Ном));
				 КонецЕсли;
				 новСтр.Количество = Стр.Кол;
				 новСтр.ручКор = Стр.РучКор;
				 новстр.Декор1 = "В базе :";
				 
			 КонецЦикла;
			 
			 
			 
			 
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	
	Элементы.Декорация1.Заголовок = "Запрос данных с сервера...";
	Элементы.Декорация1.Видимость = Истина;
	Элементы.тблОткл.Видимость = Ложь;
	
	А();
	
	Если тблОткл.Количество()=0 ТОгда
		Элементы.Декорация1.Заголовок = "Отклонений нет!";
		Элементы.Декорация1.Видимость = Истина;
	ИНаче
		Элементы.тблОткл.Видимость = Истина;
		Элементы.Декорация1.Видимость = Ложь;
	КонецЕСЛИ;
		   
КонецПроцедуры
