Функция ПроверкаВыдачи(Ном,ГарНомер,ДокументОснование,Кол) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаВыдачуТМЦ.Ссылка КАК Ссылка,
	               |	ЗаявкиНаВыдачуТМЦ.Выдано КАК Выдано,
	               |	ЗаявкиНаВыдачуТМЦ.Количество КАК Количество
	               |ИЗ
	               |	Справочник.ЗаявкиНаВыдачуТМЦ КАК ЗаявкиНаВыдачуТМЦ
	               |ГДЕ
	               |	ЗаявкиНаВыдачуТМЦ.Статус = 1
	               |	И ЗаявкиНаВыдачуТМЦ.ГарНомер = &ГарНомер
	               |	И ЗаявкиНаВыдачуТМЦ.ДокументОснование = &ДокументОснование
	               |	И ЗаявкиНаВыдачуТМЦ.Номенклатура = &Номенклатура
				   |    И Выдано < Количество
				   |";
	
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	Запрос.УстановитьПараметр("ГарНомер",ГарНомер);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() ТОгда
		Сообщить("Для "+ДокументОснование+" (Гар.№ "+ГарНомер+") нет согласованой номенклатуры "+Ном);
		Возврат ЛОжь;
	КонецЕсли;
	
	Выб = Рез.Выбрать();
	Выб.Следующий();
	
	Возврат ПроверкаВыдачиСсылка(Выб,Кол);
	
	
КонецФункции

Функция ПроверкаВыдачиСсылка(сс,Кол) Экспорт
	
	п = сс.Количество - сс.Выдано;
	Если п < Кол Тогда
		Сообщить("Недостаточно согласованного количества. Согласованно: "+сс.Количество+" выдано: "+сс.Выдано+" Затребовано: "+Кол);
		Возврат ЛОжь;
	КонецЕсли;
	
	
	Обк = сс.ссылка.ПолучитьОбъект();
	Обк.Выдано = Обк.ВЫдано + Кол;
	Обк.Записать();
	
	
	Возврат Обк.ссылка;
	
КонецФункции