Процедура ЗагрузитьАЗУР(Орг) Экспорт
	
	//Орг = глДоступ.ПолучитьНАстройку("Организация",Неопределено);
	Если Орг = Неопределено ТОгда 
		Сообщить("Не указана организация на складе");
		Возврат; 
	КонецеСЛИ;
	
	СткСоединение = глОбщий.СткПолучитьСоединениеAZURE();
	
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	, // пользователь для доступа к серверу (если он есть)
	, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);
	
	Запрос = Новый HTTPЗапрос("/ServiceMP/hs/ksAPI/AGROIL?ORG="+СокрЛП(орг.Код));
    Результат = Соединение.Получить(Запрос);
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Ошибка синхронизации: код "+Результат.КодСостояния);
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Возврат ;
	КонецЕСЛИ;
	
	Мас   = XMLзначение(Тип("ХранилищеЗначения"),результат.ПолучитьТелоКакСтроку()).Получить();
	дтИзм = Мас[0];
	
	ЗагрузитьРег(Мас[1]);
	ЗагрузитьАгр(Мас[2]);
	
КонецПроцедуры

Процедура ЗагрузитьРег(ТБлРег)
	Соо = Новый Соответствие;
	ТБлРег.Колонки.Добавить("Агрегат");
	Для каждого Стр из ТблРег Цикл
		п = Соо.Получить(Стр.агр);
		Если п=Неопределено ТОгда
			п = Справочники.ВидыАгрегатовТС.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.агр));
			Соо.Вставить(стр.агр,п);
		КонецЕСЛИ;
		
		Стр.агрегат = п;
		
	КонецЦикла;
	
	Наб = РегистрыСведений.НормыМасло.СоздатьНаборЗаписей();
	Наб.Загрузить(ТБлРег);
	Наб.Записать();
	
Конецпроцедуры

Процедура ЗагрузитьАгр(Тбл)
	
	Для каждого Стр из Тбл Цикл
		
		сс = Справочники.ВидыАгрегатовТС.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.агр));
		Если глОбщий.СсылкаСуществует(сс,"ВидыАгрегатовТС")=Ложь Тогда
			Обк = Справочники.ВидыАгрегатовТС.СоздатьЭлемент();
			Обк.Код = Стр.Код;
			Обк.Наименование = Стр.Имя;
			ОБк.УстановитьСсылкуНового(сс);
			Обк.записать();
		КонецеСЛИ;
		
	Конеццикла;
	
КонецПроцедуры