
&НаСервереБезКонтекста
Процедура СторноНаСервере(сс)
	
	
	Если ЗначениеЗаполнено(сс)=Ложь ТОгда
		Сообщить("Пустая ссылка! Нет основания для сторно!");
		Возврат;
	КонецЕСЛИ;
	
	Обк = Справочники.инвИнвентаризация.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Обк,сс,"Склад,Место,Номенклатура,ШтрихКод,лог");
	Обк.Дата = ТекущаяДата();
	Обк.Количество = -сс.количество;
	Обк.спрСторно = сс;
	Обк.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Сторно(Команда)
	СторноНаСервере(Объект.Ссылка);
	Элементы.Сторно.Видимость = ложЬ;
	ЭтаФорма.Закрыть();
	ОповеститьОЗаписиНового(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура Сделатьсторно(Команда)
	Элементы.Сторно.Видимость = 1 - Элементы.Сторно.Видимость;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьСторно(сс,ТекКол)
	Если ТекКол<=0 Тогда Возврат Ложь; КонецЕСЛИ;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	инвИнвентаризация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.инвИнвентаризация КАК инвИнвентаризация
	               |ГДЕ
	               |	инвИнвентаризация.спрСторно = &спрСторно";
	Запрос.УстановитьПараметр("спрСторно",сс);
	Возврат  Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Сделатьсторно.Видимость = ЕстьСторно(Объект.Ссылка,объект.Количество);
КонецПроцедуры
