
&НаСервереБезКонтекста
Процедура ТестСвязиНаСервере()
	
	АдресПечати = глДоступ.ПолучитьАдресСервераПечати();
	Если АдресПечати<>"" ТОгда
		текОрг = Новый Структура("ВнешнийАдрес,ВнутреннийАдрес,APIrest",АдресПечати,АдресПечати,"Base1s");
	Иначе
		текОрг = глДоступ.ПолучитьОсновнойСклад().Организация;
		Если ЗначениеЗаполнено(ТекОрг)=Ложь Тогда
			Сообщить("Ошибка определения организации по складу!");
			Возврат;
		КонецеСЛИ;
	КонецеСЛИ;
	
	Сообщить(текОрг.APIrest);
	стрАПИ = "/"+текОрг.APIrest+"/hs/invAPI/TEST";

	СткСоединение = глОбщий.СткПолучитьСоединение(текОрг);
	
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
	СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);
	
	Запрос = Новый HTTPЗапрос(стрАПИ);
	
	
	Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Сообщить(результат.ПолучитьТелоКакСтроку());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязи(Команда)
	ТестСвязиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдУстройства = Константы.ИдУстройства.Получить();
	
	Для каждого МЕта из Метаданные.Константы Цикл
		Эл = Элементы.Добавить("конст"+Мета.Имя,Тип("ДекорацияФормы"));
		//Эл.Вид=ВидПоляФормы.ПолеНадписи;
		Эл.Заголовок = ""+МЕта.Синоним+": "+Константы[Мета.Имя].Получить();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	Элементы.Список.ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КоличествоЗаписейНаСервере()
	Запрос = Новый Запрос;
	
	рез="";
	Для каждого Мета из Метаданные.Справочники Цикл
		
		Запрос.Текст = "SELECT SUM(1) инд FROM Справочник."+Мета.Имя+" Тбл";
		Выб = Запрос.Выполнить().Выбрать();
		Выб.Следующий();
		Рез=Рез+""+Мета.Имя+" - " +выб.инд+Символы.ПС;
		
	КонецЦикла;
	
	Для каждого Мета из Метаданные.Документы Цикл
		
		Запрос.Текст = "SELECT SUM(1) инд FROM Документ."+Мета.Имя+" Тбл";
		Выб = Запрос.Выполнить().Выбрать();
		Выб.Следующий();
		Рез=Рез+""+Мета.Имя+" - " +выб.инд+Символы.ПС;
		
	КонецЦикла;
	
	
	Для каждого Мета из Метаданные.РегистрыСведений Цикл
		
		Запрос.Текст = "SELECT SUM(1) инд FROM РегистрСведений."+Мета.Имя+" Тбл";
		Выб = Запрос.Выполнить().Выбрать();
		Выб.Следующий();
		Рез=Рез+""+Мета.Имя+" - " +выб.инд+Символы.ПС;
		
	КонецЦикла;
	
	Сообщить(Рез);
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписей(Команда)
	КоличествоЗаписейНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьЗаявкиНаСервере()
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаВыдачуТМЦ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ЗаявкиНаВыдачуТМЦ КАК ЗаявкиНаВыдачуТМЦ
	               |ГДЕ
	               |	ЗаявкиНаВыдачуТМЦ.Дата <= &Дата";
	Запрос.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата())-3600*24*7 );
	Выб = Запрос.Выполнить().Выбрать();
	Пока ВЫб.Следующий() Цикл
		Обк = Выб.ссылка.ПолучитьОбъект();
		Обк.Удалить();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаявки(Команда)
	УдалитьЗаявкиНаСервере();
КонецПроцедуры
