
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстФильтрСклад();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Склад") ТОгда
	Склад = Параметры.Склад;
	КонецеСЛИ;
	УстФильтрСклад();
КонецПроцедуры

&НаСервере
Процедура УстФильтрСклад()
	эл = Список.Параметры.Элементы.Найти("Склад");
	Эл.Значение = Склад;
	Эл.Использование = Истина;
КонецПроцедуры

&НаСервере
Процедура ФильтрНаСервере(Рек)
	список.Отбор.Элементы.Очистить();
	Если Рек = "" ТОгда ВозвраТ; КонецеСЛИ;
	
	НовЭл = список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовЭл.ВидСравнения=ВидСравненияКомпоновкиДанных.НеРавно;
	НовЭл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Рек);
	НовЭл.ПравоеЗначение = 0;
	НовЭл.Использование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТОлькоФакт(Команда)
	Если Команда.Имя = "ТолькоФакт" Тогда
		ФильтрНаСервере("инвКол");
	ИНАчеЕсли Команда.Имя = "ТолькоОткл" Тогда
		ФильтрНаСервере("отклКол");
	ИНАче
		ФильтрНаСервере("");
	КонецЕСлИ;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	глОбщий.ЗагрузитьОстаткиНаСервере(Склад);
КонецПроцедуры
