
Функция ПолучитьДеталиДефектовки(сс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ро_ОборудованиеДефектовка.Детали КАК Деталь,
	               |	ро_ОборудованиеДефектовка.Количество КАК Количество,
				   |    Значение(Справочник.Дефекты.Годен) Дефект,
				   |    Истина Годен
	               |ИЗ
	               |	Справочник.ро_Оборудование.Дефектовка КАК ро_ОборудованиеДефектовка
	               |ГДЕ
	               |	ро_ОборудованиеДефектовка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ссылка",сс);
	
	Тбл = Запрос.Выполнить().Выгрузить();
	
	Мас = новый Массив;
	Для каждого Стр из Тбл Цикл
		Стк = Новый Структура;
		Для каждого Кол из Тбл.Колонки Цикл
			Стк.Вставить(Кол.имя,Стр[Кол.имя]);
		КонецЦикла;
		Мас.добавить(Стк);
	КонецЦикла;
	
	Возврат Мас;
	
КонецФункции