&НаКлиенте
Перем АдресХранилища;

&НаКлиенте
Процедура ЗагрузитьНоменклатуру(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОтветНаВопросЗагрузки",ЭтотОбъект,Команда.имя); // Прописываем название процедуры-обработчика.
	
	
	ПоказатьВопрос(Оповещение, ""+Команда.Имя+" справочник номенклатуры из базы?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	РежимДиалогаВопрос.ДаНет,
	0,  // задержка (секунды). необязательно
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	"" // устанавливаем заголовок. необязательно
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветНаВопросЗагрузки(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		фнРЕз =  глВыгрузкаДанных.ПроверитьКлючФоновогоЗадания("ЗагрузкаСправочника");
		Если фнРез<>Истина ТОгда
			ОткрытьФорму("ОбщаяФорма.ПрогрессБар",Новый Структура("Адрес",АдресХранилища),ЭтаФорма,ЭтаФорма);
			Сообщить(фнРез);
			Возврат;
		КонецЕСЛИ;
		
		Если Параметры = "Обновить" Тогда
			Стк = глОбщий.ОбновитьДтСинхроНасервере();
			глВыгрузкаДанных.ЗагрузитьНоменклатуруАлга("ref",,Стк.Номенклатура-3600*24*2,АдресХранилища);
		ИНачеЕсли Параметры = "ОбновитьНеВФоне" Тогда
			Стк = глОбщий.ОбновитьДтСинхроНасервере();
			глВыгрузкаДанных.ЗагрузитьНоменклатуруАлга("ref",,Стк.Номенклатура-3600*24*2,АдресХранилища,Истина);
		ИНаче
			глВыгрузкаДанных.ЗагрузитьНоменклатуруАлга("ref",,,АдресХранилища);
		КонецЕСЛИ;
		
		ОткрытьФорму("ОбщаяФорма.ПрогрессБар",Новый Структура("Адрес",АдресХранилища),ЭтаФорма,ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсюНоменклатуру(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос",ЭтотОбъект); // Прописываем название процедуры-обработчика.
	
	ПоказатьВопрос(Оповещение, "Удалить всю номенклатуру в справочнике?",  // вместо привычного "Вопрос", теперь "ПоказатьВопрос"
	РежимДиалогаВопрос.ДаНет,
	0,  // задержка (секунды). необязательно
	КодВозвратаДиалога.Да, // задает кнопку по умолчанию. необязательно
	"" // устанавливаем заголовок. необязательно
	);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсе()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура";
	Тбл = Запрос.Выполнить().Выгрузить();
	Для каждого Стр из тбл Цикл
		Попытка
		Стр.ссылка.ПолучитьОбъект().Удалить();
		Исключение Конецпопытки;
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Производители.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Производители КАК Производители";
	Тбл = Запрос.Выполнить().Выгрузить();
	Для каждого Стр из тбл Цикл
		Попытка
		Стр.ссылка.ПолучитьОбъект().Удалить();
		Исключение Конецпопытки;
	КонецЦикла;
	
	Наб = РегистрыСведений.ШтрихКоды.СоздатьНаборЗаписей();
	Наб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт // здесь, думаю, комментировать нечего

	Если Результат = КодВозвратаДиалога.Да Тогда
		 УдалитьВсе();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда=Неопределено)
	
	ссНом = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ссНом)=Ложь Тогда 
		Сообщить("Нет объекта для печати!");
		Возврат; 
	КонецЕСЛИ;
	
	Если Команда.имя = "ПечатьЭтикеткиСУказаниемПринтера" Тогда
		глОбщийКлиент.ПечатьЭтикетки(ссНом,Истина);
	ИНаче
		глОбщийКлиент.ПечатьЭтикетки(ссНом);
	КонецЕСЛИ;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если  глДоступ.ДоступНоменклатура()=Ложь Тогда
		Элементы.Список.ТолькоПросмотр = Истина;
	КонецЕСЛИ;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ДобавитьДляПечатиНаСервере(ссНом)
	Зап = РегистрыСведений.НоменклатураДляПечати.СоздатьМенеджерЗаписи();
	Зап.Номенклатура = ссНом;
	Зап.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьДляПечати(Команда)
	
		ссНом = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ссНом)=Ложь Тогда 
		Сообщить("Нет объекта для печати!");
		Возврат; 
	КонецЕСЛИ;
	
	
	ДобавитьДляПечатиНаСервере(ссНом);
КонецПроцедуры


&НаКлиенте
Процедура СписокПечатиЭтикеток(Команда)
	ОткрытьФорму("РегистрСведений.НоменклатураДляПечати.ФормаСписка",,ЭтаФорма);
КонецПроцедуры

