
&НаКлиенте
Процедура СканироватьШтрихКод(Команда=Неопределено)
	РезультатВыгрузки = "";
	#Если МобильноеПриложениеКлиент Тогда
		Опопвещение = Новый ОписаниеОповещения("ЗавершениеСканирования",ЭтотОбъект);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование QR-кода",Опопвещение,,ТипШтрихКода.Двухмерный);
		
		//бин = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя);
		//Сообщить(Бин.ТипСодержимого);
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиОрг(ИНН)
	сс = Справочники.Организации.НайтиПоКоду(ИНН);
	Если сс.Пустая() Тогда
		Возврат Неопределено;
	ИНАче
		Возврат сс;
	Конецесли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыгрузитьДанныеВБазу(текОрг,ГУИД)
	
	ИмяМетода = "QRDOC";
	
			 
			 СткСоединение = глОбщий.СткПолучитьСоединение(текОрг);
			 стрАПИ = "/"+текОрг.APIrest+"/hs/invAPI/"+ИмяМетода;
			 
			 Соединение = Новый HTTPСоединение(
			 СткСоединение.Сервер, // сервер (хост)
			 СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
			 СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
			 СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
			 , // здесь указывается прокси, если он есть
			 , // таймаут в секундах, 0 или пусто - не устанавливать
			 // защищенное соединение, если используется https
			 );
			 
			 Тело = ГУИД+Символы.ПС
			 	  +глДоступ.ПолучитьИмяПользователя()+Символы.ПС
				  +ИмяКомпьютера();
			 
			 Запрос = Новый HTTPЗапрос(стрАПИ);
			 Запрос.УстановитьТелоИзСтроки(Тело);
			 
			 Результат = Соединение.ОтправитьДляОбработки(Запрос);
			 Если Результат.КодСостояния <> 200 Тогда 
				 Сообщить(результат.ПолучитьТелоКакСтроку()+" "+"Ошибка синхронизации: код "+Результат.КодСостояния);
				 Возврат Ложь;
			 КонецЕСЛИ;
			 
			 Возврат  результат.ПолучитьТелоКакСтроку();
			 
			 
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеСканирования(ШтрихКод,Результат,Сообщение,ДопПар ) Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	Если Лев(ШтрихКод,6) <> "_!!!__" Тогда
		Сообщить("Неверный формат QR кода");
		Возврат;
	КонецЕСЛИ;
	
	пСтр = СтрЗаменить(Сред(ШтрихКод,7),"%%",Символы.ПС);
	ИНН = СтрПолучитьСтроку(пСтр,1);
	ГУИД= СтрПолучитьСтроку(пСтр,2);
	
	ссОрг = НайтиОрг(ИНН);
	Если ссОрг=Неопределено Тогда
		Сообщить("Организация с ИНН "+ИНН+" не найдена");
		Возврат;
	КонецеСлИ;
	
	
	РезультатВыгрузки= ВыгрузитьДанныеВБазу(ссОрг,ГУИД);
	Если РезультатВыгрузки=ЛОжь ТОгда
		РезультатВыгрузки = "Ошибка выгрузки в базу 1с";
	КонецЕСЛИ;
	
	
	
	
	
	
	

	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СканироватьШтрихКод();
КонецПроцедуры

