Функция  ПоследнийНезакратыйДень() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	MIN(СинхроДвж.Дата) КАК Дата
	               |ИЗ
	               |	РегистрСведений.СинхроДвж КАК СинхроДвж
	               |ГДЕ
	               |	СинхроДвж.ДатаСинхронизации = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	ТБл = Запрос.Выполнить().Выгрузить();
	
	Если Тбл.Количество()<>0  ТОгда
		Возврат ТБл[0].Дата;
	ИНаче
		Возврат Неопределено;
	КонецЕСЛИ;
	
	
КонецФункции

Функция ПоследняяВыгрузкаНаСервер(Склад) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "
|ВЫБРАТЬ
|	MAX(СинхроДвж.ИнфоПослДатаСинхронизации) КАК ДатаСинхронизации,
|	MAX(СинхроДвж.Дата) КАК Дата
|
|ИЗ
|	РегистрСведений.СинхроДвж КАК СинхроДвж
|ГДЕ
|	СинхроДвж.Склад = &Склад
| и ИнфоПослДатаСинхронизации <> ДатаВремя(1,1,1)
|
|";
	
	Запрос.УстановитьПараметр("Склад",Склад);

	Рез = Новый Структура("ДатаСинхронизации,Дата",Дата(1,1,1),Дата(1,1,1));
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Рез,Выб);
	КонецЕСЛИ;
	
	Возврат Рез;
	
КонецФункции

Процедура ПризнакСинхронизацииСклада(Склад,Дата) Экспорт
	
	Зап = РегистрыСведений.СинхроДвж.СоздатьМенеджерЗаписи();
	Зап.Склад = Склад;
	Зап.Дата = Дата;
	Зап.Прочитать();
	Если Зап.Выбран()=ложь или Зап.ДатаСинхронизации <> дата(1,1,1) Тогда
		Зап.Склад = Склад;
		Зап.Дата = Дата;
		Зап.ДатаСинхронизации = дата(1,1,1);
		Зап.Записать();
	КонецЕслИ;
	
КонецПроцедуры