Процедура СторноНаСервере(сс) Экспорт
	
	Если ЗначениеЗаполнено(сс)=Ложь ТОгда
		Сообщить("Пустая ссылка! Нет основания для сторно!");
		Возврат;
	КонецЕСЛИ;
	
	Если (ТекущаяДата() - сс.дата) > 7 *3600*24 Тогда
		Сообщить("Нельзя сторнировать списание ТМЦ глубже 7 дней!");
		Возврат;
	КонецеСЛИ;
	
	Обк = Справочники.двжТМЦ.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Обк,сс,"Склад,Место,Номенклатура,ШтрихКод,лог,ГарНомер,ТабНомер,ТС,Сотрудник,ДокументОснование,ГосНомер,ВесУтиль,Агрегат,ТипРасходаМасла,ВидДвижения,ИННДО");
	Если НачалоДня(сс.Дата) = НачалоДня(ТекущаяДата()) Тогда
		Обк.Дата = ТекущаяДата();
	ИНаче
		обк.Дата = КонецДня(сс.дата);
	КонецеслИ;
	Обк.Количество = -сс.количество;
	Обк.спрСторно = сс;
	Обк.Записать();
	
	
КонецПроцедуры