
&НаСервере
Процедура ДатаСпискаПриИзмененииНаСервере(Использовать)
	// Вставить содержимое обработчика.
	поле = Новый ПолеКомпоновкиДанных("Дата");
	Для каждого Эл из список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение <> Поле Тогда Продолжить; КонецеСЛИ;	
		Если Эл.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			Эл.ПравоеЗначение = ДатаСписка;
		ИНаче
			Эл.ПравоеЗначение = КонецДня(ДатаСписка)+1;
		КонецЕсли;
		эл.Использование = Использовать;
	КонецЦикла;
	
	Элементы.Дата1.Видимость = Не Использовать;
	
КонецПроцедуры

&НаСервере
Процедура ПоискНоменклатураПриИзмененииНаСервере(Использовать,Мас=Неопределено)
	// Вставить содержимое обработчика.
	поле = Новый ПолеКомпоновкиДанных("Ссылка");
	Для каждого Эл из список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Эл.ЛевоеЗначение <> Поле Тогда Продолжить; КонецеСЛИ;	
		Если Мас<>Неопределено Тогда
			Эл.ПравоеЗначение = Мас;
		КонецесЛИ;
		эл.Использование = Использовать;
		прервать;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСпискаПриИзменении(Элемент)
	ДатаСпискаПриИзмененииНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаСписка = ТекущаяДата();
	ДатаСпискаПриИзмененииНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВесьПериод(Команда)
	ДатаСпискаПриИзмененииНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНазад(Команда)
	ДатаСписка = НачалоДня(ДатаСписка - 3600*24);
	ДатаСпискаПриИзмененииНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВперед(Команда)
	ДатаСписка = НачалоДня(ДатаСписка + 3600*24);
	ДатаСпискаПриИзмененииНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьДень(Команда)
	ТекДт = глОбщий.ПоследнийНезакратыйДень();
	Если ЗначениеЗаполнено(ТекДТ)=Ложь ТОгда
		Сообщить("Все транзакции закрыты!");
		Возврат;
	КонецеСЛИ;
	
	Пока ТекДт < ТекущаяДата() Цикл
		глВыгрузкаДанных.ВыгрузитьДвжТМЦ(Истина);
		ТекДт = КонецДня(ТекДт)+1;
	КонецЦикла;
	Оповестить("ОбновитьДтСинхро");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьДокумент(Команда)
	// Вставить содержимое обработчика.
	#Если МобильноеПриложениеКлиент Тогда
		Опопвещение = Новый ОписаниеОповещения("ЗавершениеСканирования",ЭтотОбъект);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование штрих-кода",Опопвещение);
		
		//бин = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя);
		//Сообщить(Бин.ТипСодержимого);
	#КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершениеСканирования(ШтрихКод,Результат,Сообщение,ДопПар ) Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	ЗаполнитьОснование(ШтрихКод);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОснование(ДанныЕ)
	
	Если стрДлина(ДанныЕ)<21  Тогда
		Возврат;
	КонецЕСЛИ;
	
	Стк = Новый Структура();
	Стк.Вставить("данныеПар",Данные);
	
	//СткРез = глОбщийКлиент.ЗаполнитьОснование(ДанныЕ);
	
	
	ОткрытьФорму("Документ.ВыдачаТМЦ.ФормаОбъекта",Стк);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	глВыгрузкаДанных.ВыгрузитьВыдачаТМЦ();
КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	Элементы.ПоискНоменклатура.Видимость = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиДокиПоНом(Ном)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ DISTINCT
	               |	ВыдачаТМЦМатериалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ВыдачаТМЦ.Материалы КАК ВыдачаТМЦМатериалы
	               |ГДЕ
	               |	ВыдачаТМЦМатериалы.Номенклатура = &Номенклатура
	               |	И ВыдачаТМЦМатериалы.Ссылка.Дата >= &Дата";
	Запрос.УстановитьПараметр("Номенклатура",Ном);
	Запрос.УстановитьПараметр("Дата",ДобавитьМЕсяц(ТекущаяДата(),-1));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПоискНоменклатураПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПоискНоменклатура)=Ложь Тогда
		Элементы.ПоискНоменклатура.Видимость = Ложь;
		ПоискНоменклатураПриИзмененииНаСервере(Ложь);
		Возврат;
	КонецесЛИ;
	
	МАсДок = НайтиДокиПоНом(ПоискНоменклатура);
	ПоискНоменклатураПриИзмененииНаСервере(Истина,МасДок);
КонецПроцедуры


