&НаКлиенте
Перем КонстантаСклад;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КонстантаСклад = глДоступ.ПолучитьОсновнойСклад();
	Если ЗначениеЗаполнено(КонстантаСклад) = Ложь ТОгда
		отказ = истина;
		Сообщить("Не выбран склад!");
	КонецЕСЛИ;
	
	
	Если ЗначениеЗаполнено(Объект.Склад)=Ложь ТОгда
		Объект.Склад = КонстантаСклад;
	КонецЕсЛИ;
	
	Если ЗначениеЗаполнено(ОБъект.ссылка) ТОгда
		Элементы.ГруппаДанных.ТолькоПросмотр = Истина;
	КонецЕСЛИ;
	
	//Элементы.Сделатьсторно.Видимость = Не Объект.Отменить и ЗначениеЗаполнено(Объект.ссылка);
	Если Объект.ВидДвижения = 1 Тогда
		Элементы.Группа3.Заголовок = "Смена места";
		Элементы.Группа4.Видимость = Ложь;
		ЭтаФорма.Заголовок = "Смена места";
	КонецеСЛИ;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШК(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Опопвещение = Новый ОписаниеОповещения("ЗавершениеСканирования",ЭтотОбъект);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканирование штрих-кода",Опопвещение);
		
		//бин = СредстваМультимедиа.СделатьФотоснимок(ТипКамерыУстройства.Задняя);
		//Сообщить(Бин.ТипСодержимого);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеСканирования(ШтрихКод,Результат,Сообщение,ДопПар ) Экспорт
	
	НоменклатураОкончаниеВводаТекста(Неопределено, ШтрихКод, Неопределено, Неопределено, ложь);	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидДвижения = 1 ТОгда
		Объект.Номенклатура = Объект.НоменклатураНовая;
		Если СокрлП(Объект.Место)="" Тогда
			Сообщить("Не указано место!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура)=Ложь ТОгда
		Сообщить("Не выбрана номенклатура");
		Отказ = Истина;
		Возврат;
	КонецеСЛИ;
	Если ЗначениеЗаполнено(Объект.НоменклатураНовая)=Ложь ТОгда
		Сообщить("Не выбрана номенклатура");
		Отказ = Истина;
		Возврат;
	КонецеСЛИ;
	Если ЗначениеЗаполнено(Объект.Склад)=Ложь ТОгда
		Сообщить("Не выбран склад");
		Отказ = Истина;
		Возврат;
	КонецеСЛИ;
	Если Объект.Количество = 0 ТОгда
		Сообщить("Не указано количество");
		Отказ = Истина;
		Возврат;
	КонецеСЛИ;
	
	
	Объект.Дата = текущаяДата();
	Объект.Лог = ""+ТекущаяДата()+"_"+ИмяКомпьютера();

КонецПроцедуры
	

&НаСервере
Функция ПолучитьТхтОстатки(текИнв,КонстантаСклад)
	
	тблОст.Очистить();
	
	Если ЗначениеЗаполнено(текИнв) = Ложь Тогда
		Возврат "";
	КонецЕСЛИ;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |    Место,
				   |	SUM(Остатки.Количество) КАК Ост
				   |ИЗ
				   |	РегистрСведений.Остатки КАК Остатки
				   |ГДЕ
				   |	Остатки.Номенклатура = &Номенклатура
				   |  и Склад = &Склад
				   |  и Забаланс = Ложь
				   |GROUP BY Место
				   |";
	Запрос.УстановитьПараметр("Номенклатура",текИнв);
	Запрос.УстановитьПараметр("Склад",КонстантаСклад);
	ТблОст.Загрузить(запрос.Выполнить().Выгрузить());
	
	
	Возврат тблОст.Итог("ост");
	
	
КонецФункции


&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст="", ДанныеВыбора=Неопределено, ПараметрыПолученияДанных=Неопределено, СтандартнаяОбработка=Истина)
	СтандартнаяОбработка = ложь;
	ТекНом = Неопределено;
	ШтрихКод = "";
	Производитель = "";
	
	Если Лев(Текст,3) = "(!)" Тогда
		Объект.Место = Сред(Текст,4);
		#Если МобильноеПриложениеКлиент Тогда
			СредстваМультимедиа.ВоспроизвестиТекст("Место "+Объект.Место); 
		#КонецЕсли
		Текст="";
	Иначе
		ТекНом = глОбщий.НоменклатураАвтоПодборНаСервере(Текст,ШтрихКод,Производитель);
		Объект.Количество = ПолучитьТхтОстатки(ТекНом,КонстантаСклад);
	КонецЕслИ;
	
	
	Если ТекНом <> Неопределено Тогда
		Сигнал();
		Текст = "";
		ЭтаФорма.СтрокаПодбора = "";
		Объект.НоменклатураНовая = ТекНом;
		Этаформа.Модифицированность = Истина;
		
	ИНаче
		ЭтаФорма.СтрокаПодбора = Текст;
		
		//Объект.НоменклатураНовая = Неопределено;
	КонецеСЛИ;
	
	//ОбновитьОтображениеДанныхФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Стк = Новый Структура("Склад",КонстантаСклад);
	ОткрытьФорму("Обработка.Подбор.Форма.Форма",стк,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПодбора(Номенклатура,Место,Количество) Экспорт
	Объект.Номенклатура      = Номенклатура;
	Объект.Количество        = Количество;
	Этаформа.Модифицированность = Истина;

КонецПроцедуры

//---------------------------------
&НаСервере
Процедура СторноНаСервере(сс)
	
	
	Обк = РеквизитФормыВЗначение("Объект");
	Обк.Количество = 0;
	Обк.Отменить = Истина;
	Обк.Записать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сторно(Команда)
	
	СторноНаСервере(Объект.Ссылка);
	ЭтаФорма.Закрыть();
	ОповеститьОЗаписиНового(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Сделатьсторно(Команда)
	Элементы.Сторно.Видимость = 1 - Элементы.Сторно.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура МестоПриИзменении(Элемент)
	Если Лев(Сокрлп(Объект.МЕсто),3) = "(!)" Тогда
		Объект.МЕсто = Сред(Сокрлп(Объект.МЕсто),4);
	КонецЕСЛИ;
КонецПроцедуры






	


